Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: For example, 0xFF (on ASCII platforms) does not caselessly match the character at 0x178, C<LATIN CAPITAL LETTER Y WITH DIAERESIS>, because 0xFF may not be C<LATIN SMALL LETTER Y WITH DIAERESIS> in the current locale, and Perl has no way of knowing if that character even exists in the locale, much less what code point it is.
es: Por ejemplo, 0xFF (en plataformas ASCII) no coincide con el carácter 0x178, C<LATIN CAPITAL LETTER Y WITH DIAERESIS> sin distinguir mayúsculas de minúsculas, ya que 0xFF quizás no sea C<LATIN SMALL LETTER Y WITH DIAERESIS> en la configuración regional actual, y Perl no puede determinar si ese carácter existe en la configuración regional, y mucho menos a qué código de carácter corresponde.

source: For example, C<-w textsize:15> will call C<< $formatter->textsize(15) >> on the formatter object before it is used to format the object.
es: Por ejemplo, C<-w textsize:15> llamará a C<< $formatter->textsize(15) >> en el objeto formateador antes de que se use para aplicar formato al objeto.

source: For example, C<BENGALI DIGIT FOUR> (U+09EA) looks very much like an C<ASCII DIGIT EIGHT> (U+0038).
es: Por ejemplo, C<BENGALI DIGIT FOUR> (U+09EA) se parece mucho a C<ASCII DIGIT EIGHT> (U+0038).

source: For example, C<Your-Module-1.33.tar.gz> should be downloaded as C<Your-Module-1_33.tgz>.
es: Por ejemplo, al descargar deberá cambiar el nombre C<Mi-Modulo-1.33.tar.gz> por C<Mi-Modulo-1_33.tgz>.

source: For example, HTML::Entities requires version >= 1.32 to function correctly, even though the changelog is silent about this.
es: Por ejemplo, HTML::Entities requiere la versión >= 1.32 para funcionar correctamente, aunque esto no se indica en el registro de cambios.

source: For example, although the POSIX module happens to do both dynamic loading and autoloading, the user can say just C<use POSIX> to get it all.
es: Por ejemplo, aunque el módulo POSIX realiza tanto carga dinámica como carga automática, el usuario solo tiene que escribir C<use POSIX> para obtenerlo todo.

source: For example, instead of returning its last mod time as a number, the C<File> class could return a L<DateTime> object representing that value.
es: Por ejemplo, en lugar de devolver la hora de última modificación como un número, la clase C<Archivo> podría devolver un objeto de clase L<DateTime> que representa este valor.

source: For example, parallelism means "awk and perl" and "Python and Perl" look good, while "awk and Perl" and "Python and perl" do not.
es: Por ejemplo, por paralelismo podemos intuir que "awk y perl" y "Python y Perl" son aceptables, mientras que "awk y Perl" y "Python y perl" no lo son.

source: For example, C<*name> stands for any or all of C<$name>, C<@name>, C<%name>, C<&name>, or just C<name>.
es: Por ejemplo, C<*nombre> puede significar C<$nombre>, C<@nombre>, C<%nombre>, C<&nombre> o simplemente C<nombre>.

source: For example, C<-oLaTeX> currently tries all of the following classes: Pod::Perldoc::ToLaTeX Pod::Perldoc::Tolatex Pod::Perldoc::ToLatex Pod::Perldoc::ToLATEX Pod::Simple::LaTeX Pod::Simple::latex Pod::Simple::Latex Pod::Simple::LATEX Pod::LaTeX Pod::latex Pod::Latex Pod::LATEX.
es: Por ejemplo, C<-oLaTeX> prueba todas las clases siguientes: Pod::Perldoc::ToLaTeX Pod::Perldoc::Tolatex Pod::Perldoc::ToLatex Pod::Perldoc::ToLATEX Pod::Simple::LaTeX Pod::Simple::latex Pod::Simple::Latex Pod::Simple::LATEX Pod::LaTeX Pod::latex Pod::Latex Pod::LATEX.

source: For example, C</(?<=\t)\w+/> matches a word that follows a tab, without including the tab in C<$&>.
es: Por ejemplo, C</(?<=\t)\w+/> detecta una palabra que sigue a una tabulación, sin incluir la tabulación en C<$&>.

source: For example, C</\w+(?=\t)/> matches a word followed by a tab, without including the tab in C<$&>.
es: Por ejemplo, C</\w+(?=\t)/> detecta una palabra seguida de una tabulación, sin incluir la tabulación en C<$&>.

source: For example, C<LATIN SMALL LIGATURE FI> should match the sequence C<fi>.
es: Por ejemplo, C<LATIN SMALL LIGATURE FI> debería detectar la secuencia C<fi>.

source: For example, C<\w> will match the "word" characters of that locale, and C<"/i"> case-insensitive matching will match according to the locale's case folding rules.
es: Por ejemplo, C<\w> detectará los caracteres de tipo "palabra" de esa configuración regional y la detección sin distinguir mayúsculas de minúsculas que ofrece C<"/i"> funcionará según las reglas correspondientes de la configuración regional.

source: For example, C<\x{...}> can't have spaces because hexadecimal numbers don't have spaces in them.
es: Por ejemplo, C<\x{...}> no puede contener espacios porque los números hexadecimales no contienen espacios.

source: For example, E-mail and HTTP support MIME headers, so you can use the C<Content-Type> header.
es: Por ejemplo, el correo electrónico y HTTP son compatibles con los encabezados MIME, por lo que puede usar el encabezado C<Content-Type>.

source: For example, a module C<Foo::Bar> should use keys such as C<Foo::Bar/baz> and C<Foo::Bar/$%/_!>.
es: Por ejemplo, un módulo llamado C<Foo::Bar> debe usar claves como C<Foo::Bar/baz> o C<Foo::Bar/$%/_!>.

source: For example, a numeric data type has a certain set of numbers that you can work with and various mathematical operations that you can do on the numbers but would make little sense on, say, a string such as C<"Kilroy">.
es: Por ejemplo, un tipo de datos numérico tiene un determinado conjunto de números que se pueden usar y varias operaciones matemáticas que se pueden aplicar a los números pero que tendrían poco sentido con una cadena como C<"Kilroy">, por ejemplo.

source: For example, an object might represent a file.
es: Por ejemplo, un objeto podría representar un archivo.

source: For example, consider the following scenario.
es: Por ejemplo, considere el siguiente escenario.

source: For example, evaluating a simple assignment statement typically has the "side effect" of assigning a value to a variable.
es: Por ejemplo, la evaluación de una instrucción de asignación sencilla suele tener el "efecto secundario" de asignar un valor a una variable.

source: For example, every C<File> object has a path.
es: Por ejemplo, cada objeto de la clase C<Archivo> tiene su propia ruta.

source: For example, if Leon Brocard changes his name to Orange Brocard, we should change his name in the AUTHORS file:
es: Por ejemplo, si Leon Brocard decide cambiar de nombre y pasar a llamarse Orange Brocard, tendremos que actualizar su nombre en el archivo AUTHORS:

source: For example, if the object is an anonymous hash, we can store the attribute values in the hash using the attribute name as the key.
es: Por ejemplo, si el objeto es un hash anónimo, podemos almacenar los valores de los atributos en el hash usando los nombres de los mismos como claves.

source: For example, if the bug is present on C<HEAD> but wasn't in 5.10.0, C<git> will learn about this when you enter:
es: Por ejemplo, si el error está presente en C<HEAD> pero no estaba en la versión 5.10.0, C<git> lo averiguará cuando ejecute:

source: For example, if we have an C object, it has the C<print_info()> method from C<File>:
es: Por ejemplo, si tenemos un objeto de la clase C, hereda el método C<imprimir_info()> de la clase C<Archivo>:

source: For example, if you put C<{0,5}> instead of C<*> on the external group, no current optimization is applicable, and the match takes a long time to finish.
es: Por ejemplo, si usa C<{0,5}> en lugar de C<*> en el grupo externo, no se aplica ninguna optimización, y la búsqueda de coincidencia tardará mucho tiempo en terminar.

source: For example, if you say
es: Por ejemplo, si escribe

source: For example, if you try to read data past the end of a file, Perl will hand you back an undefined value.
es: Por ejemplo, si intenta leer datos cuando ya se ha acabado el archivo, Perl devolverá un valor indefinido.

source: For example, if you want to know when this became an error:
es: Por ejemplo, si desea saber en qué confirmación la línea siguiente pasó a ser un error:

source: For example, in Perl, changing elements of the C<%ENV> array also changes the corresponding environment variables that subprocesses will use.
es: Por ejemplo, en Perl, si se cambian los elementos del array C<%ENV>, también se cambian las variables de entorno correspondientes que los subprocesos usarán.

source: For example, in the absence of parentheses, you always do multiplication before addition.
es: Por ejemplo, si no se usan paréntesis, una multiplicación siempre se realizará antes que una suma.

source: For example, it allows you to pass a method name to be called as a parameter to another method.
es: Por ejemplo, permite pasar el nombre de un método que se va a llamar como parámetro a otro método.

source: For example, our F</etc/hostname> object belongs to the C<File> class.
es: Por ejemplo, nuestro objeto F</etc/hostname> pertenece a la clase C<Archivo>.

source: For example, say you need to create a class implementing overloaded mathematical operators, and would like to provide your own pragma that functions much like C<use integer;> You'd like this code
es: Supongamos que vamos a crear una clase que implementa operadores matemáticos sobrecargados y queremos proporcionar nuestro propio pragma, que funcione de manera parecida a C<use integer;>. Lo llamaremos C<entero>. Queremos que el código siguiente:

source: For example, the construct C<< Class->new() >> can be interpreted as either C<< 'Class'->new() >> or C<< Class()->new() >>.
es: Por ejemplo, la construcción C<< Clase->new() >> puede interpretarse como C<< 'Clase'->new() >> o como C<< Clase()->new() >>.

source: For example, this code:
es: Por ejemplo, este código:

source: For example, this is applicable to C<printf "%s", $value>.
es: Por ejemplo, esto es aplicable a C<printf "%s", $valor>.

source: For example, this program
es: Por ejemplo, este programa

source: For example, to grab non-empty comments into $1, one should use either one of these:
es: Por ejemplo, para capturar la parte no vacía de los comentarios en $1, hay que usar uno de estos patrones:

source: For example, to set your global git config to send email via a gmail account:
es: Por ejemplo, para establecer la configuración global de git para enviar correo electrónico a través de una cuenta de gmail:

source: For example, to start a traditional, non-OO module called Some::Module, create a file called F<Some/Module.pm> and start with this template:
es: Por ejemplo, para empezar a desarrollar un módulo tradicional, no orientado a objetos, llamado Mi::Modulo, cree el archivo F<Mi/Modulo.pm> y use esta plantilla:

source: For example, utf8 can be used for code points that don't exist in Unicode, like 9999999, but if you encode that to UTF-8, you get a substitution character (by default; see L<Encode/"Handling Malformed Data"> for more ways of dealing with this.)
es: Por ejemplo, se puede usar utf8 para códigos de carácter que no existen en Unicode, como 9999999, pero si los codifica en UTF-8, obtendrá caracteres sustitutos de manera predeterminada (vea la sección "Handling Malformed Data" de L<Encode> para obtener información sobre otras maneras de abordar este problema).

source: For example, we could create an C class which B<inherits> from C<File>.
es: Por ejemplo, podríamos crear una clase C que B<herede> de C<Archivo>.

source: For example, we could have C<File> and C<WebPage> classes which both have a C<print_content()> method.
es: Por ejemplo, podríamos tener las clases C<Archivo> y C<PaginaWeb>, ambas con un método C<imprimir_contenido()>.

source: For example, we have F<lib/strict.pm> and F<lib/strict.t>.
es: Por ejemplo, tenemos F<lib/strict.pm> y F<lib/strict.t>.

source: For example, we might define C<File::MP3::FixedBitrate> and C<File::MP3::VariableBitrate> classes to distinguish between different types of mp3 file.
es: Por ejemplo, podríamos definir las clases C<Archivo::MP3::VelBitsFija> y C<Archivo::MP3::VelBitsVariable> para distinguir entre diferentes tipos de archivos mp3.

source: For example, without internal optimizations done by the regular expression engine, this will take a painfully long time to run:
es: Por ejemplo, sin las optimizaciones internas del motor de expresiones regulares, la siguiente detección de coincidencias tardará muchísimo tiempo:

source: For example, you stick 10,000 things in a hash, but evaluating %HASH in scalar context reveals C<"1/16">, which means only one out of sixteen buckets has been touched, and presumably contains all 10,000 of your items.
es: Por ejemplo, si insertamos 10 000 valores en un hash, pero al evaluar %HASH en contexto de escalar nos devuelve C<"1/16">, significa que solo se ha ocupado una de dieciséis casillas, que probablemente contiene los 10 000 elementos.

source: For example, your locale might not think that C<LATIN SMALL LETTER ETH> is a letter (unless you happen to speak Icelandic), but Unicode does.
es: Por ejemplo, aunque una configuración regional no considere que C<LATIN SMALL LETTER ETH> es una letra (a menos que corresponda a un sistema islandés), Unicode sí lo considerará como una letra.

source: For example: C<-oman>.
es: Por ejemplo: C<-oman>.

source: For example: C<< ^(?>a*)ab >> will never match, since C<< (?>a*) >> (anchored at the beginning of string, as above) will match I<all> characters C<a> at the beginning of string, leaving no C<a> for C<ab> to match.
es: Por ejemplo: C<< ^(?>a*)ab >> nunca coincidirá, ya que C<< (?>a*) >> (anclada al comienzo de la cadena, como antes) encontrará I<todos> los caracteres C<a> al comienzo de la cadena, sin dejar ninguno para que C<ab> coincida.

source: For example: C<perldoc -MPod::Perldoc::ToChecker>.
es: Por ejemplo: C<perldoc -MPod::Perldoc::ToChecker>.

source: For example: if in the parent there are two references to a single blessed hash, then in the child there will be two references to a single undefined scalar value instead.
es: Por ejemplo; si en el hilo primario hay dos referencias a un hash bendecido, en el hilo derivado habrá dos referencias a un valor escalar no definido.

source: For examples of MRO implementations, see C<S_mro_get_linear_isa_c3()> and the C<BOOT:> section of F<mro/mro.xs>, and C<S_mro_get_linear_isa_dfs()> in F<mro.c>
es: Si desea ver ejemplos de implementaciones de orden de resolución de métodos, consulte C<S_mro_get_linear_isa_c3()> y la sección C<BOOT:> de F<mro/mro.xs>, y vea también C<S_mro_get_linear_isa_dfs()> en F<mro.c>

source: For http and ftp, you can use http://webproxy:3128 as proxy.
es: Para http y ftp puede usar http://webproxy:3128 como proxy.

source: For information on OO programming with Perl, please see L<perlootut> and L<perlobj>.
es: Para obtener más información sobre la programación orientada a objetos en Perl, vea L<perlootut> y L<perlobj>.

source: For instance the following:
es: Por ejemplo:

source: For instance,
es: Por ejemplo,

source: For instance, saying C<use Net::Acme qw(&frob)> would import the C<frob> subroutine.
es: Por ejemplo, C<use Net::Acme qw(&frob)> importará la subrutina C<frob>.

source: For instance, C<$$> is the current process id.)
es: por ejemplo, C<$$> es el ID del proceso actual).

source: For instance, if you model an elevator, your elevator object might have an C<open_door()> L</method>.
es: Por ejemplo, si modela un ascensor, el objeto ascensor puede tener un L</método> C<abrir_puerta()>.

source: For instance, if you say this:
es: Por ejemplo, si escribe:

source: For instance, in the example above, the final C<print $y> would cause a compile-time error and prevent you from running the program.
es: Así, en el ejemplo anterior, la última instrucción C<print $y> provocará un error en tiempo de compilación que impedirá la ejecución del programa.

source: For instance, the typical "match a double-quoted string" problem can be most efficiently performed when written as:
es: Por ejemplo, el problema típico de "detectar una cadena escrita entre comillas dobles" se puede solucionar de forma más eficaz mediante:

source: For instance, there is nowhere within package C<OUTER> that C<$INNER::var> refers to C<$OUTER::INNER::var>.
es: Por ejemplo, no hay ningún lugar dentro del paquete C<EXTERIOR> en el que la variable <$INTERIOR::var> pueda hacer referencia a C<$EXTERIOR::INTERIOR::var>.

source: For instance, when you call C<power("puff")>, the string C<"puff"> is the actual argument.
es: Por ejemplo, al realizar la llamada C<encendido("activar")>, la cadena C<"activar"> es el valor del argumento.

source: For instance, where I say C<perl Makefile.PL>, you can substitute C<perl Makefile.PL PREFIX=/my/perl_directory> to install the modules into C</my/perl_directory>.
es: Por ejemplo, en lugar de C<perl Makefile.PL>, puede ejecutar C<perl Makefile.PL PREFIX=/mi/directorio_perl> para instalar los módulos en C</mi/directorio_perl>.

source: For instance, while utilities have "USAGE" sections, Perl modules usually have "SYNOPSIS" sections: C<podselect -s "SYNOPSIS" ...> will extract this section for a given file.
es: Por ejemplo, a diferencia de las utilidades que tienen secciones "USAGE", los módulos Perl generalmente tienen secciones "SYNOPSIS" (SINOPSIS): C<podselect -s "SYNOPSIS" ...> extrae la sección correspondiente de un archivo especificado.

source: For instance:
es: Por ejemplo:

source: For larger sets of commits that only make sense together, or that would benefit from a summary of the set's purpose, you should use a merge commit.
es: Para grandes conjuntos de confirmaciones que solo tienen sentido juntas, o que puedan beneficiarse de disponer de un resumen de propósito del conjunto, es recomendable usar una confirmación de combinación.

source: For many people, Perl serves as a great replacement for shell scripting.
es: Para muchas personas, Perl es un buen sustituto de los scripts de shell.

source: For more information about either conference, check out their respective web pages: OSCON L<http://conferences.oreillynet.com/>; YAPC L<http://www.yapc.org>.
es: Para obtener más información sobre estas conferencias, visite sus páginas web: OSCON L<http://conferences.oreillynet.com/>; YAPC L<http://www.yapc.org>.

source: For more detail on looping constructs (and some that weren't mentioned in this overview) see L<perlsyn>.
es: Para obtener más información sobre las estructuras de bucle (y otras estructuras que no se han mencionado en esta introducción ), consulte L<perlsyn>.

source: For more information on writing subroutines, see L<perlsub>.
es: Para obtener más información sobre cómo escribir subrutinas, consulte L<perlsub>.

source: For more information, including instructions for other platforms such as Windows and Mac OS, read L<perlrun>.
es: Para obtener más información e instrucciones para otras plataformas, como Windows y Mac OS, lea L<perlrun>.

source: For more on this, see L<perlootut> and L<perlobj>.
es: Encontrará más información en L<perlootut> y L<perlobj>.

source: For new code, we recommend that you use the L<parent> pragma to declare your parents.
es: Pero en el código nuevo recomendamos usar el pragma L<parent> para declarar las clases primarias.

source: For object oriented code, C<WWW::Mechanize> or the C<Email::*> modules provide some good examples.
es: C<WWW::Mechanize> y los módulos C<Email::*> son buenos ejemplos de código orientado a objetos.

source: For one thing, the modifiers affect only pattern matching, and do not extend to even any replacement done, whereas using the pragmas give consistent results for all appropriate operations within their scopes.
es: Por una parte, los modificadores solo afectan a la detección de coincidencias de patrones y no se extienden ni siquiera a las sustituciones, mientras que el uso de los pragmas produce resultados coherentes para todas las operaciones apropiadas dentro de sus ámbitos de aplicación.

source: For others, it serves as a convenient, high-level replacement for most of what they'd program in low-level languages like C or C++.
es: Para otros, es un cómodo sustituto de alto nivel para realizar la mayor parte de los programas que desarrollarían en lenguajes de bajo nivel como C o C++.

source: For our File::MP3 class, we can check to make sure that the path we're given ends with ".mp3":
es: Para la clase Archivo::MP3 podemos comprobar que la ruta termina en ".mp3":

source: For portability, when using features that may not be implemented on every machine, test the construct in an eval to see if it fails.
es: Para garantizar la portabilidad, si utiliza características que podrían no estar implementadas en todos los equipos, debe usar C<eval> para comprobar si el código genera algún error.

source: For reasons of security, this construct is forbidden if the regular expression involves run-time interpolation of variables, unless the perilous C<use re 'eval'> pragma has been used (see L<re>), or the variables contain results of the C<qr//> operator (see L<perlop/"qr/STRINGE<sol>msixpodual">).
es: Por razones de seguridad, esta construcción está prohibida si la expresión regular requiere interpolar variables en tiempo de ejecución, a menos que el peligroso pragma C<use re 'eval'> esté activo (vea L<re>) o las variables contengan resultados del operador C<qr//> (vea L<perlop/"qr/CADENAE<sol>msixpodual">).

source: For reasons of security, this construct is forbidden if the regular expression involves run-time interpolation of variables, unless the perilous C<use re 'eval'> pragma has been used (see L<re>), or the variables contain results of the C<qr//> operator (see L<perlop/"qrE<sol>STRINGE<sol>msixpodual">).
es: Por razones de seguridad, esta construcción está prohibida si la expresión regular incluye interpolación de variables en tiempo de ejecución, a menos que el peligroso pragma C<use re 'eval'> esté en uso (vea L<re>), o las variables contengan resultados del operador C<qr//> (vea L<perlop/"qr/CADENAE<sol>msixpodual">).

source: For reference on how regular expressions are used in matching operations, plus various examples of the same, see discussions of C<m//>, C<s///>, C<qr//> and C<??> in L<perlop/"Regexp Quote-Like Operators">.
es: Si desea consultar una referencia de uso de expresiones regulares en operaciones de detección de coincidencias, con ejemplos variados, puede ver las descripciones de C<m//>, C<s///>, C<qr//> y C<??> en L<perlop/"Operadores de entrecomillado para expresiones regulares">.

source: For simple names like 'foo', when the normal search fails to find a matching page, a search with the "perl" prefix is tried as well.
es: En el caso de nombres sencillos, como 'foo', si la búsqueda normal no encuentra una página coincidente, se realiza también una búsqueda con el prefijo "perl".

source: For small systems, L<Object::Tiny> and L<Class::Accessor> both provide minimal object systems that take care of basic boilerplate for you.
es: Para sistemas pequeños, tanto L<Object::Tiny> como L<Class::Accessor> ofrecen sistemas minimalistas que se ocupan de las tareas repetitivas y simplifican el trabajo.

source: For some dual-life modules, it has not yet been determined if the CPAN version or the blead source is canonical.
es: Para algunos módulos de evolución dual aún no se ha determinado si la versión canónica es la de CPAN o la del código fuente de la rama I<blead>.

source: For starters, it has its own IRC network, L<irc://irc.perl.org>.
es: Para los que empiezan, tiene su propia red de IRC, L<irc://irc.perl.org>.

source: For the remainder of this document, we'll assume that you really honestly truly lack an installed module, but have found it on the CPAN.
es: En lo sucesivo supondremos que no tiene el módulo instalado y que lo ha encontrado en CPAN.
